[
  {
    "path": "posts/2021-06-20-dataviz1/",
    "title": "Data Viz 1",
    "description": "Explore different perspectives and approaches to design more truthful and enlightening data visualisation.",
    "author": [
      {
        "name": "Amrita Mishra",
        "url": "https://amritamishradatablog.netlify.app/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\nThe Task\r\n1. Critic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\n\r\nClarity\r\nOverall visualization does not depict if the export is more than the import or if the import is more than the export. Visually, we can only see colours patch and not much information. A bar chart / even a time series would have depicted this information better.\r\nEven though the x-axis says monthly data, the data shown in the graph is yearly data. Since the raw data is for a period of 2 years (by monthly data), a time series chart would be more helpful to check the trend of imports/exports in the 2 years’ period.\r\nGiven that the 6 countries’ graphs are shown separately, there is no single graph presented to show if the overall numbers have a trend. A graph for all 6 countries for exports and a graph for all 6 countries for imports would tell a different story.\r\nAesthetics\r\nThe graphical representation does not have a clear marking by month even thought the y-axis says the data is month of period. We can make the graph bigger to cover the data for 24 months (2 years) to show the trend.\r\nThe colours in the graph are overlapping and there is no clear demarcation to show the where the exports and imports exceed each other and under which month/year. This graph is visually not appealing.\r\nWhile dual axis helps to differentiate the data between import and export values, trade gap (export-import) data is required by economists to evaluate the difference and assess the gap.\r\n2. With reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nI would propose to split the graph into 2 to show the time series between import and export. At the same time, I would calculate a trade gap to show when the gap was positive and negative.\r\nSketch of the proposed design below:\r\n\r\nThe advantages of a time series chart is that:\r\nIt shows the trend over a course of time taking into account the highs and lows of both imports and exports.\r\nThe time clearly depicts the trend that the trade is following for a particular country.\r\nThe advantages of a bar chart for the trade gap data is:\r\nGap analysis may be easily identified to show the economists where there is a shortfall in export/import as this directly impacts the GDP.\r\nThe months whereby the trade gap was positive or negative is easily visualized without any further calculations.\r\n3. Using Tableau, design the proposed data visualization.\r\nPlease view the proposed data visualization in Tableau Public here.\r\n4.Provide step-by-step description on how the data visualization was prepared.\r\nData Download:\r\nDownload the data from here [https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data] under region/market section.\r\nThe output consists of data across all countries for many years prior to 2021.\r\nData Cleansing:\r\nUsing the output file, we will do basic data filtering to use only the relevant data. We are only interested to review the data of countries - Mainland China, HongKong, Taiwan, Japan, Malaysia and United States.\r\nWe will filter the 6 countries’ data and add it to a sheet labeled as “Combine”. The data is transposed in order to plot a time series easily. The data is further filtered to show only Jan 2019 to Dec 2020 data.All the countries’ data is added one after the other. We will only use the columns - Date, Import, Export, Country.\r\nMetadata Information: Date - Month and year of data Import - Import Value of the country Export - Export value of the country Country - To which country the value belongs to\r\n\r\nData Import to Tableau:\r\nWe will open Tableau 2021.1 version of desktop app. We will import the revised excel file “OutputFile_V1”. We will change the data type of Month/Year to “Date” type.\r\n\r\nData Visualisation Preparation for Static Graphs:\r\nWe will go to our first worksheet which has the attributes on the left. Our goal is to prepare a remodeled graph for each of the 6 countries in a static form.\r\nWe will build a trade gap graph and an import/export graph for the 6 countries.\r\nBuilding the Trade Gap graph:\r\nStep1 We need to derive a new field called Trade Gap. This is the difference between Export and Import values. We will use the “Create Quick Calculation” method to add the formula for trade gap and then a new attribute wil appear under “measure”.\r\n\r\nStep2 We will use the “Create calculated Field” to derive 2 new attributes: “Negative Trade Value” and “Positive Trade value”. These are just +/- numbers based on the trade gap formula.\r\n\r\nStep3 Add the country to the filter tab. We will use the filter to build a static dashboard for the respective country. For the 1st dashboard, filter the country.\r\nFor columns, add the Date by year, quarter and month. For Rows, we will add the Trade Gap.\r\n\r\nStep4 We will review the marks pane and perform the necessary changes to reflect the data correctly. Trade Gap would be dragged to “Colour”. Negative and Positive values will be added to “Details”. Overall structure will be changed to “Bar” to represent a bar graph.\r\n\r\nStep5 For the X-axis, change the range to fix it between 1/1/2019 and 31/12/2020. Change the name of the axis to Month/Year. The tick interval is set at 1 month.\r\nStep6 It is important to standardise the colour of the graph. We will use the Edit colour feature on the right side to make the changes. Red indicates negative trade value. Blue indicates a positive value.\r\n\r\nStep7 Edit the Worksheet title by double clicking on the title and editing the data in the edit title pane. Reflect the country by inserting the country sheet from the “Insert” function.\r\n\r\nStep8 CLick on the tool tip attribute to make further enhancements to our visual.\r\n\r\nStep9 The trade gap graph is now ready. Repeat this for all 6 countries to get the final trade gap graphs.\r\n\r\n\r\n\r\nBuilding the country wise import/export values’ time series graph.\r\nStep1 Add the Month/Year under Column and Export / Import under Rows.\r\n\r\nStep2 Change the worksheet title to reflect the country by inserting the country sheet from the “Insert” function.\r\n\r\nStep3 Use the Mark Pane to make the changes to export and import lines. Export line is blue. Import line is orange. The type of the graph is line graph. The size is increased to define the density.\r\n\r\nStep4 You would notice that the export is on the y-axis on the left and import is on the y-axis on the right.\r\nStep5 For the X-axis, change the range to fix it between 1/1/2019 and 31/12/2020. Change the name of the axis to Month/Year. The tick interval is set at 1 month.\r\n\r\nStep6 For the y-axis, we may choose to shorten the graph by fixing the axis between 2 points. This value will vary between countries because some have long range while some have a short range starting only 300K. Since the final graph would be plotted on a single axis, we refrain from adjusting the y-axis values.\r\nStep7 The 1st time series graph is now ready. We repeat this for the 6 countries. Final output is shown below.\r\n\r\n\r\n\r\n\r\n\r\n5.The final graphs of the 6 countries combined.\r\nIt is important to notice how visuals can change our assumption without looking at the data carefully. We will use the dashboard feature to combine the data and plot 2 graphs. It is essential to plot the 2 graphs separately as they are telling a different story.\r\n1 is a graph of import/export for the 6 countries. 1 is a trade gap graph for the 6 countries. Both the graphs are depicted for 2 years.\r\nStep1 We will open a new worksheet.This will be to compare the trade gap of the 6 countries in a single snapshot.\r\nStep2 We will add the Date under column and Trade Gap under rows.\r\nStep3 We will use the marks pane to add visual attributes to our graph. COuntries will be dragged to colours. Positive and Negative trade values will be dragged to details.\r\nStep4 Edit the X-axis to represent the right range of data.\r\nStep5 Edit the sheet title to show “2019-2020 Trade Gap Comparison by Countries”.\r\nStep6 Right click on the y-axis to add a reference line. We will fix it at the constant 0 to differentiate the positive and negative values.\r\nFinal Graph is ready as below.\r\n\r\nStep7 We will open a new worksheet.This will be to compare the import/export of the 6 countries in a single snapshot.\r\nStep8 We will add the Country, Year and Measure Names under column and Measure Values under rows. This step is important because we are trying to compare 2 measures - import and export against the 6 countries.\r\nStep9 We will use the marks pane to add visual attributes to our graph. Measure Values will be added to the colour pane to show different colour for import and export.\r\nStep10 Edit the X-axis to represent the right range of data.Since we are showing 6 countries’ data for 2 years, we will increase the ticker size to 1year to show only the yearly data. This is to ensure the graph looks neat and yet represents the correct information for the economists to evaluate.\r\nStep11 Edit the sheet title to show “2019-2020 Export/Import Data”. Final Graph is ready as below.\r\n\r\nThe Final Dashboard Using the dashboard feature, we will drag the 2 consolidated worksheets to the layout pane. In a single view, we can see the performance of import/export per country for the 2 years. At the same time, the graph below would show the countries where the trade gap is positive or negative.\r\n\r\n6. Describe three major observations revealed by the data visualisation prepared.\r\nThe benefits of a time series chart is that, it shows us a clear trend, gap and possible direction of the numbers. Benefits of the bar chart is that - it shows a clear demarcation of the data.\r\na) Export: - The export value of Mainland China declined sharply from Dec 2019 to Feb 2020. Then, it gradually increased. The absolute values of export are highest for Mainland China from Aug 2020 to Dec 2020.Looking at the overall 2019-2020 numbers, Mainland China had the highest export values. - The absolute export numbers are second highest for Hong Kong for 2019-2020. - The export values of United States is declining since Aug 2020.\r\nb) Import: - The import values of Hong Kong is the lowest, consistently for the 2 years. - It is interesting to see that China retains the highest import values in absolute terms given the size of the country.However, the exports are higher ensuring a positive trade gap. - Taiwan has higher import values than export values throughout 2019-2020 suggesting that Taiwan imports most of the goods into the country but does not export much.\r\nc) Gap Analysis: - Gap analysis reveals that Hong Kong has the highest positive trade balance. The exports have been higher than imports for the years 2019-2020. - Taiwan has the highest negative trade balance. Taiwan has high imports and the value of exports has not exceeded its import in 2019 and 2020.\r\nKey Links\r\nGithub: https://github.com/Amrita83\r\nNetlify:https://amritamishra.netlify.app/\r\nTableau:https://public.tableau.com/app/profile/amrita.mishra/viz/DataViz_1_May2021/TradeDashboard\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T12:06:32+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-20-dataviz2/",
    "title": "Data Viz 2",
    "description": "The purpose of the makeover is to improve on the original visualisation. Focus on what works, what doesn’t work, why those things don’t work, and how we made it better. Problem solving is key to Data Science.",
    "author": [
      {
        "name": "Amrita Mishra",
        "url": "https://amritamishradatablog.netlify.app/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\nThe Task\r\n1. Critic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nSource: Department of Statistics, Singapore\r\n\r\nIntent of Graphical Representation: Provide Visual representation of Exports (Y-axis) and Imports (X-axis) i.e., Exports Vs Imports Value for multiple markets with respect to Singapore.\r\nData Inputs for producing visual representation is as follows: Input 1:Market Input 2:Imports Input 3:Exports\r\nPossible inferences include (Business values for each market in terms of Imports ($ Value) Vs Export ($Value)\r\nClarity\r\nOverall basic visual representation of data is unclear. It is unclear if the size of the bubble represents the size of the trade since the size of the bubble is relative to one another.\r\nAdding a white dot to the import/export region to represent net trade value is very unclear and does not indicate a trade surplus/deficit visually.\r\nSince each market is represented by a colour and there are many overlaps, it is unclear how a market is performing.\r\nDollar value represented on the graph seems to be total business value of import + export. Since only the overall trade value is represented on graph, it does not show a visual split of the import and export values.\r\nThe X-axis and Y-axis are misleading with no unit numbers or axis details mentioned. As a reader, I do not know whether the 80 means 80million, 80% or what attribute.\r\nThe graph seems static and we do not know for which period was the graph made. Ideally, a graph should show the trend if it is supposed to reflect growth. If the graph is indicative of trade for a particular year, the year details should be mentioned clearly.\r\nAesthetics\r\na) Color coding for Thailand and EU seem very similar, including the labeling and the bubble representation. The colours could be made different (if a colour is absolutely needed).\r\nb) The United States label seems to point to some data in the graph but visualization is unclear. Similar issues exists for Malaysia\r\nc) Bucketing / summing up the total trade value for both imports and exports does not represent the true trade affair of the country. It would be easier to show each country separately for a deep dive analysis of the import/export analysis. Alternatively, a trend line may be used to show the growth of trade (import/export) over the years to reflect the true nature of Singapore’s trade with its trading partners.\r\n2. With reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. The proposed alternative design should include appropriate interactive techniques. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nIntent of Data Visualization can be better visualized by plotting using line graphs with different color coding of Nations/Countries and Dollar Values for Imports and Exports separately for each country. Final representation must enable Business User to identify Dollar Values of Each Country/Nation for their Import Vs Export to determine the nett trade.\r\n3. Using Tableau, design the proposed data visualization.\r\nPlease view the proposed data visualization in Tableau Public here\r\n4.Provide step-by-step description on how the data visualization was prepared.\r\nData Download:\r\nDownload the data from here [https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data] under region/market section.\r\nThe output consists of data across all countries for many years prior to 2021.\r\nData Cleansing:\r\nMetadata Information: Date - Month and year of data Import - Import Value of the country Export - Export value of the country Country - To which market the value belongs to\r\nOnce the data is extracted, we will filter out the 10 markets’ data along with the import/export values for 2011Jan -2020 Dec. \r\nThis step can also be carried out in Tableau by importing the 2 excel tabs T1 and T2, joining them together.\r\nAfter which, a formula can be added to join the records from T1 = T2.\r\nOnce the records are joined, we review the data type and convert all the import and export values to “Numeric” and check on the “Month/Year” data type to Date format.\r\nOur cleansing part is now done and we can use the worksheet tab to tabulate our interactive charts. For Data Visualisation, it is seldom possible to add all the information in a single chart especially when there are multiple variables, markets and 10 years worth of data to view.\r\nThis is where an interactive charts become useful in providing us an overview and also a method to view singular data if we want.\r\nTableau Preparation\r\nChart 1: Performance by Country Our 1st chart is to perform interactive chart by market for the 10years for import and export data. 1. We drag the countries attribute to “Filters” section. Ensure to select only the 10 required countries that we need. 2. We drag Year to Columns and Sum(Export) & Sum(Import) to Rows. 3. Under the marks pane, we select the graph as line. 4. We drag the measure names to colour pane. 5. Check if both Export and Import panes are reflecting the above configuration. 6. We edit the countries’ filter by adding “Show Filter”. This will populate a chart on the right which allows us to click multiple values. We are only interested in seeing the deep dived data for a single market. Hence, we will change the show filter to a single radio button. 7. Our market wise interactive chart is ready to see how each of the market performed in the last 10 years.\r\nChart 2: Trade Gap by Year For the 2nd chart, we will check how the trade gap perform for each of the 10 markets by the years. Since we want to see all the 10 countries together, we will apply a year wise filter.\r\nDrag the year attribute to filter pane. Ensure you select only 2011 Jan to 2020 Dec data.\r\nWe need to calculate Trade Gap which is the Sum(Export)-Sum(Import). We will use the formula under Analysis to create this new calculated attribute.\r\nOur target is to make a bubble chart to show all the markets by year. The bubbles will be coloured based on their deficit type. If export is > import, then trade deficit is positive and will be green. If trade deficit is negative, the colour will be red. It is worth knowing that the deficit with a market is from Singapore perspective only.It does not mean that the respective market has a trade deficit.\r\nWe shall drag the Trade Gap attribute to Size, then again to colour. We shall add the Country to Details.\r\nUsing the Filter attribute, we will “Show Filter” for the years. A multi select chart will open up. We will change it to single value radio button.\r\nUnder the colours, we will edit the colours to reflect red and green and only 2 solid colours with mid-point being 0.\r\n\r\n\r\n\r\nThe Final Dashbaord\r\nWe have prepared an interactive dashboard that retains the original design and also clearly highlights the import/export data of the 10 markets by years 2011-2020. The dashboard is interactive with radio buttons which allow the user to deep dive to a particular year to see the data.\r\n\r\n5. Describe three major observations revealed by the data visualisation prepared.\r\nTaiwan: The import of Taiwan has been higher than exports consistently since 2011-2020. There was an import dip in the year 2016 but effective 2017, the import went up. It has the highest import in comparison to the remaining 9 markets.\r\n\r\nHong Kong: In contrast, Hong Kong has the highest export values consistently since 2011-2020.The values once reached 65.7M in 2018 (the highest export values recorded when compared to other markets). It is interesting to note that COVID has no impact on trade for this market.\r\n\r\nMainland China: As per the original graph, it looks like Mainland China has the highest import and export values. While the absolute values of import and export is indeed the highest, the trade gap between export and import is not high for Mainland China.It is interesting to note that other countries like Indonesia and Malaysia have a higher or equal trade gap suggesting that Singapore probably imports more from Indonesia and Malaysia than exports to them. Whereas, Singapore’s import/export values with China is on par. After 2019, the import values seem to decline possibly owing to COVID reasons\r\n\r\nUnited States: It is interesting to see that United States does not have large import / export values or a large trade gap. However, since Covid started, Singapore exported a lot of goods out to the US. Since mid-2020, the export values have overtaken the import values.The trade gap has shrunk over the last 10years while the overall trade exports have grown.\r\n\r\nMalaysia: Since the onset of COVID, trade with Malaysia has entered into a deficit. This is possible due to many household goods which are imported from Malaysia. There is constantly a rising demand of household goods in Singapore due to circuit breaker / restrictions of travelling out of the country. Demand of groceries and eatables have gone up.\r\n\r\nEU: While EU is actually large and comprises of many countries, the trade with EU is the lowest, hovering around 30-60K (’000) only.This indicates that Singapore may have its own favourities for trading and mostly the neighbouring countries are prominent trading partners.\r\n\r\nTrading Partners: In the last 10 years, Mainland China and Malaysia have remained as the top 2 trading partners of Singapore.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T17:02:31+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-20-dataviztutorial/",
    "title": "Data Viz Tutorial",
    "description": "Learning the techniues of Data Viz taught by our professor Dr.Kam Tin Siong.",
    "author": [
      {
        "name": "Amrita Mishra",
        "url": "https://amritamishradatablog.netlify.app/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nFigure below shows the quadrant plot of Tableau.\r\n The screenshot below shows how to edit the file:\r\n Next, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T13:16:39+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Data Blog",
    "description": "Welcome to our new Data Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Amrita Mishra",
        "url": "https://amritamishradatablog.netlify.app/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T13:09:16+08:00",
    "input_file": {}
  }
]
